> Could you verify that this error does not occur any more with Docker v18.06?

```
$ terraform init
Initializing modules...

Initializing the backend...

Initializing provider plugins...
- Checking for available provider plugins...
- Downloading plugin for provider "docker" (terraform-providers/docker) 2.1.1...

The following providers do not have any version constraints in configuration,
so the latest version was installed.

...
```

Here's my docker version:
```
Client: Docker Engine - Community
 Version:           19.03.1
 API version:       1.40
 Go version:        go1.12.5
 Git commit:        74b1e89
 Built:             Thu Jul 25 21:18:17 2019
 OS/Arch:           darwin/amd64
 Experimental:      false

Server: Docker Engine - Community
 Engine:
  Version:          19.03.1
  API version:      1.40 (minimum version 1.12)
  Go version:       go1.12.5
  Git commit:       74b1e89
  Built:            Thu Jul 25 21:17:52 2019
  OS/Arch:          linux/amd64
  Experimental:     true
 containerd:
  Version:          v1.2.6
  GitCommit:        894b81a4b802e4eb2a91d1ce216b8817763c29fb
 runc:
  Version:          1.0.0-rc8
  GitCommit:        425e105d5a03fabd737a126ad93d62a9eeede87f
 docker-init:
  Version:          0.18.0
  GitCommit:        fec3683
```

on terraform apply:
```
$ terraform apply --target=module.api_gateway_service
module.api_gateway_server.data.alicloud_images.default: Refreshing state...
module.api_gateway_server.data.alicloud_instance_types.default: Refreshing state...
module.api_gateway_server.data.alicloud_vpcs.default: Refreshing state...
module.api_gateway_server.alicloud_security_group.api_gateway: Refreshing state... [id=sg-k1a69zsx0a3xeijnipy4]
module.api_gateway_server.alicloud_instance.api_gateway: Refreshing state... [id=i-k1a69zsx0a3xeijj0gxv]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.api_gateway_service.docker_container.apim will be created
  + resource "docker_container" "apim" {
      + attach           = false
      + bridge           = (known after apply)
      + container_logs   = (known after apply)
      + exit_code        = (known after apply)
      + gateway          = (known after apply)
      + id               = (known after apply)
      + image            = (known after apply)
      + ip_address       = (known after apply)
      + ip_prefix_length = (known after apply)
      + log_driver       = "json-file"
      + logs             = false
      + must_run         = true
      + name             = "api-manager"
      + network_data     = (known after apply)
      + restart          = "no"
      + rm               = false
      + start            = true

      + ports {
          + external = 8280
          + internal = 8280
          + ip       = "0.0.0.0"
          + protocol = "tcp"
        }
      + ports {
          + external = 8243
          + internal = 8243
          + ip       = "0.0.0.0"
          + protocol = "tcp"
        }
      + ports {
          + external = 9763
          + internal = 9763
          + ip       = "0.0.0.0"
          + protocol = "tcp"
        }
      + ports {
          + external = 9443
          + internal = 9443
          + ip       = "0.0.0.0"
          + protocol = "tcp"
        }
    }

  # module.api_gateway_service.docker_image.apim will be created
  + resource "docker_image" "apim" {
      + id     = (known after apply)
      + latest = (known after apply)
      + name   = "wso2/wso2am:2.6.0"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

module.api_gateway_service.docker_image.apim: Creating...

Error: Unable to read Docker image into resource: Unable to list Docker images: Error response from daemon: client version 1.39 is too new. Maximum supported API version is 1.38

  on api_gateway_service/main.tf line 9, in resource "docker_image" "apim":
   9: resource "docker_image" "apim" {
```